{
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "displayName": "MTR-Windows-Compliance",
  "description": "Compliance policy for Microsoft Teams Rooms on Windows",
  "version": 1,
  "passwordRequired": false,
  "passwordBlockSimple": false,
  "passwordRequiredToUnlockFromIdle": false,
  "passwordMinutesOfInactivityBeforeLock": null,
  "passwordExpirationDays": null,
  "passwordMinimumLength": null,
  "passwordMinimumCharacterSetCount": null,
  "passwordRequiredType": "deviceDefault",
  "passwordPreviousPasswordBlockCount": null,
  "requireHealthyDeviceReport": false,
  "osMinimumVersion": "10.0.22631",
  "osMaximumVersion": null,
  "mobileOsMinimumVersion": null,
  "mobileOsMaximumVersion": null,
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "bitLockerEnabled": true,
  "secureBootEnabled": true,
  "codeIntegrityEnabled": true,
  "storageRequireEncryption": true,
  "activeFirewallRequired": true,
  "defenderEnabled": true,
  "defenderVersion": null,
  "signatureOutOfDate": true,
  "rtpEnabled": true,
  "antivirusRequired": true,
  "antiSpywareRequired": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "configurationManagerComplianceRequired": false,
  "tpmRequired": true,
  "deviceCompliancePolicyScript": null,
  "validOperatingSystemBuildRanges": [],
  "scheduledActionsForRule": [
    {
      "@odata.type": "microsoft.graph.deviceComplianceScheduledActionForRule",
      "ruleName": "DeviceNonComplianceRule",
      "scheduledActionConfigurations": [
        {
          "@odata.type": "microsoft.graph.deviceComplianceActionItem",
          "gracePeriodHours": 0,
          "actionType": "block",
          "notificationTemplateId": "",
          "notificationMessageCCList": []
        }
      ]
    }
  ]
}
